[
  {
    "cycle": 1,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "Palindrome",
        "question": "Write a Java program that checks whether a given string is a palindrome or not. Ex: MALAYALAM is palindrome."
      },
      {
        "date": "4/10/2023",
        "title": "Frequency of a character",
        "question": "Write a Java Program to find the frequency of a given character in a string"
      },
      {
        "date": "4/10/2023",
        "title": "Matrix Multiplication",
        "question": "Write a Java program to multiply two given matrices"
      }
    ]
  },
  {
    "cycle": 2,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "Inheritance",
        "question": "Write a Java program which creates a class named 'Employee' having the following members: Name, Age, Phone number, Address, Salary. It also has a method named 'printSalary( )' which prints the salary of the Employee. Two classes 'Officer' and 'Manager' inherits the 'Employee' class. The 'Officer' and 'Manager' classes have data members 'specialization' and 'department' respectively. Now, assign name, age, phone number, address and salary to an officer and a manager by making an object of both of these classes and print the same. (Exercise to understand inheritance)"
      },
      {
        "date": "4/10/2023",
        "title": "Method Overriding",
        "question": "Write a java program to create an abstract class named Shape that contains an empty method named numberOfSides( ). Provide three classes named Rectangle, Triangle and Hexagon such that each one of the classes extends the class Shape. Each one of the classes contains only the method numberOfSides( ) that shows the number of sides in the given geometrical structures. (Exercise to understand polymorphism). "
      }
    ]
  },
  {
    "cycle": 3,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "Packages",
        "question": "Write a java programme which contain three classes A,B,Main.The class A is in package ‘packageone’ and contain a method ‘methodclassone’ that prints a message stating that it is printed from classA .Similarly class B is in ‘packagetwo’ and contain a method ‘methodclasstwo’ that print a message stating that it is printed from classB.The Main class import these classes creates their instances and invokes their corresponding methods."
      },
      {
        "date": "4/10/2023",
        "title": "Interface",
        "question": "Consider a scenario where an interface named ‘Animal’ is in package named ‘animalpackage ’ and it declares two methods ‘get_cries’ and ‘get_eating_type’ that are place holders for printing cry and eating type of animals.The subpackages of ‘animalpackage ’ are ‘herbivorous’ and ‘carnivorous’.The ‘herbivorous’ package contain two classes ‘cow’ and ‘elephant’ that implements the ‘Animal’ interface. Similarly the ‘carnivorous’ package contain ‘lion’ and ‘bear’ that too implements the interface.Design a main class that import these classes and invokes the corresponding methods."
      }
    ]
  },
  {
    "cycle": 4,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "File Handling using reader or writer",
        "question": "Write a file handling program in Java with reader/writer."
      },
      {
        "date": "4/10/2023",
        "title": "File Handling using exception handling",
        "question": "Write a Java program that read from a file and write to file by handling all file related exceptions"
      },
      {
        "date": "4/10/2023",
        "title": "String Tokenizer",
        "question": "Write a Java program that reads a line of integers, and then displays each integer, and the sum of all the integers (Use String Tokenizer class of java.util)"
      }
    ]
  },
  {
    "cycle": 5,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "Exception Handling",
        "question": "Write a Java program that shows the usage of try, catch, throws and finally."
      },
      {
        "date": "4/10/2023",
        "title": "Multi Threaded Programming",
        "question": "Write a Java program that implements a multi-threaded program which has three threads. First thread generates a random integer every 1 second. If the value is even, second thread computes the square of the number and prints. If the value is odd the third thread will print the value of cube of the number."
      },
      {
        "date": "4/10/2023",
        "title": "Thread Synchronization",
        "question": "Write a Java program that shows thread synchronization"
      }
    ]
  },
  {
    "cycle": 6,
    "questions": [{
        "date": "4/10/2023",
        "title": "Simple Calculator",
        "question": "Write a Java program that works as a simple calculator. Arrange Buttons for digits and the +, -, *, % operations properly. Add a text field to display the result. Handle any possible exceptions like divide by zero. Use Java Swing"
      },
      {
        "date": "4/10/2023",
        "title": "Traffic Light",
        "question": "Write a Java program that simulates a traffic light. The program lets the user select one of three lights: red, yellow, or green. When a radio button is selected, the light is turned on, and only one light can be on at a time. No light is on when the program starts"
      }]
  },
  {
    "cycle": 7,
    "questions": [
      {
        "date": "4/10/2023",
        "title": "Doubly Linked List",
        "question": "Write a Java program for the following: (1) Create a doubly linked list of elements. (2) Delete a given element from the above list. (3) Display the contents of the list after deletion."
      },
      {
        "date": "4/10/2023",
        "title": "Quick sort",
        "question": "Write a Java program that implements Quick sort algorithm for sorting a list of names in ascending order. "
      },
      {
        "date": "4/10/2023",
        "title": "Binary Search",
        "question": "Write a Java program that implements the binary search algorithm"
      }
    ]
  }
]